app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `login_id` = '67'
AND `email` = 'adrian@gmail.com'
 LIMIT 1
---
    public function attemptLogin()
    {
        $id = trim((string) $this->request->getPost('id'));
        $password = $this->request->getPost('password');
        $email = trim((string) $this->request->getPost('email'));
        $userModel = new UserModel();
        $users = $userModel
            ->where('login_id', $id)
            ->where('email', $email)
            ->first();

SELECT *
FROM `users`
WHERE `email` = 'bob@gmail.com'
 LIMIT 1
---
    public function attemptRegister()
    {
        $name = trim($this->request->getPost('name'));
        $email = trim($this->request->getPost('email'));
        $id = trim($this->request->getPost('id'));
        $password = $this->request->getPost('password');

        if (empty($name) || empty($id) || empty($email) || empty($password)) {
            return redirect()
                ->back()
                ->withInput()
                ->with('error', 'All fields are required.');
        }
        if (!filter_var($email, FILTER_VALIDATE_EMAIL)) {
            return redirect()
                ->back()
                ->withInput()
                ->with('error', 'Please enter a valid email address.');
        }
        if (strlen($password) < 8) {
            return redirect()
                ->back()
                ->withInput()
                ->with('error', 'Password must be at least 8 characters.');
        }
        $userModel = new UserModel();
        $existingUser = $userModel
            ->where('email', $email)
            ->first();

INSERT INTO `users` (`username`, `email`, `hash_password`, `role`, `login_id`, `logout_at`) VALUES ('Bob', 'bob@gmail.com', '$2y$12$tVrKxBUCxCF.AQDF6HF/Ue/ZcIu3o1kjZQnrgOKT/HC9D2eD2Cily', 'faculty', '12345678', '2026-09-15 14:28:34')
---
            $password,
            PASSWORD_DEFAULT
        );
        $userModel->insert([
            'username'      => $name,
            'email'         => $email,
            'hash_password' => $hashedPassword,
            'role'          => 'faculty',
            'login_id'      => $id,
            'logout_at'     => date('Y-m-d H:i:s'),
        ]);