app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `email` = 'adrian@gmail.com'
 LIMIT 1
---
    public function attemptLogin()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $userModel = new UserModel();
        $user = $userModel
            ->where('email', $email)
            ->first();