app/Controllers/Dashboard.php

SELECT *
FROM `users`
WHERE `role` = 'faculty'
---
    public function show_faculty()
    {
        $facultyModel = new UserModel();
        $faculty = $facultyModel
            ->where('role', 'faculty')
            ->findAll();