app/Controllers/Dashboard.php

    public function show_room()
{
    $roomModel = new RoomsModel();
    $rooms = $roomModel->findAll();
---
SELECT *
FROM `rooms`

public function show_sections()
{
    $sectionsModel = new SectionsModel();
    $sections = $sectionsModel
        ->orderBy('sec_code', 'ASC')
        ->findAll();
---
SELECT *
FROM `sections`
ORDER BY `sec_code` ASC