app/Controllers/Dashboard.php

public function show_faculty()
{
    $facultyModel = new UserModel();
    $faculty = $facultyModel
        ->select('
            id,
            login_id,
            username,
            email,
            academic_rank,
            college,
            department,
            total_lab_units,
            total_lec_units,
            total_extra_units
        ')
        ->where('role', 'faculty')
        ->findAll();
---
SELECT `id`, `login_id`, `username`, `email`, `academic_rank`, `college`, `department`, `total_lab_units`, `total_lec_units`, `total_extra_units`
FROM `users`
WHERE `role` = 'faculty'

    public function show_room()
{
    $roomModel = new RoomsModel();
    $rooms = $roomModel->findAll();
---
SELECT *
FROM `rooms`

public function show_sections()
{
    $sectionsModel = new SectionsModel();
    $sections = $sectionsModel
        ->orderBy('sec_code', 'ASC')
        ->findAll();
---
SELECT *
FROM `sections`
ORDER BY `sec_code` ASC

public function show_subjects()
{
    $subjectsModel = new SubjectsModel();
    return $this->response->setJSON(
        $subjectsModel->findAll()
    );
---
SELECT *
FROM `subjects`

public function delete_section($id)
{
    $sectionsModel = new SectionsModel();
    $section = $sectionsModel->find($id);
    if (!$section) {
        return $this->response
            ->setStatusCode(404)
            ->setJSON([
                'success' => false,
                'message' => 'Section not found.'
            ]);
    }
    if (!$sectionsModel->delete($id)) {
---
SELECT *
FROM `sections`
WHERE `sections`.`id` = '1'
DELETE FROM `sections`
WHERE `id` IN ('1')